import { EventItem, JobItem, User, JobApplication } from './types';

export const THAI_PROVINCES = [
  'กรุงเทพมหานคร', 'กระบี่', 'กาญจนบุรี', 'กาฬสินธุ์', 'กำแพงเพชร', 
  'ขอนแก่น', 'จันทบุรี', 'ฉะเชิงเทรา', 'ชลบุรี', 'ชัยนาท', 
  'ชัยภูมิ', 'ชุมพร', 'เชียงราย', 'เชียงใหม่', 'ตรัง', 
  'ตราด', 'ตาก', 'นครนายก', 'นครปฐม', 'นครพนม', 
  'นครราชสีมา', 'นครศรีธรรมราช', 'นครสวรรค์', 'นนทบุรี', 'นราธิวาส', 
  'น่าน', 'บึงกาฬ', 'บุรีรัมย์', 'ปทุมธานี', 'ประจวบคีรีขันธ์', 
  'ปราจีนบุรี', 'ปัตตานี', 'พระนครศรีอยุธยา', 'พะเยา', 'พังงา', 
  'พัทลุง', 'พิจิตร', 'พิษณุโลก', 'เพชรบุรี', 'เพชรบูรณ์', 
  'แพร่', 'พัทลุง', 'ภูเก็ต', 'มหาสารคาม', 'มุกดาหาร', 
  'แม่ฮ่องสอน', 'ยโสธร', 'ยะลา', 'ร้อยเอ็ด', 'ระนอง', 
  'ระยอง', 'ราชบุรี', 'ลพบุรี', 'ลำปาง', 'ลำพูน', 
  'เลย', 'ศรีสะเกษ', 'สกลนคร', 'สงขลา', 'สตูล', 
  'สมุทรปราการ', 'สมุทรสงคราม', 'สมุทรสาคร', 'สระแก้ว', 'sara_buri', 'สระบุรี', 
  'สิงห์บุรี', 'สุโขทัย', 'สุพรรณบุรี', 'สุราษฎร์ธานี', 'สุรินทร์', 
  'หนองคาย', 'หนองบัวลำภู', 'อ่างทอง', 'อำนาจเจริญ', 'อุดรธานี', 
  'อุตรดิตถ์', 'อุทัยธานี', 'อุบลราชธานี'
];

export const MOCK_USERS: User[] = [
  {
    id: 'admin_evein',
    username: 'Admin_Poei',
    realName: 'ผู้ดูแลระบบสูงสุด Poei',
    role: 'WebsiteManager',
    gender: 'LGBTQ',
    age: 35,
    email: 'adminpoei@evein.com',
    phone: '0812411982',
    password: 'Poei2411982A',
    bio: 'ผู้ดูแลสูงสุดระบบ EveIn Luxury Platform มีสิทธิ์เข้าถึงทุกปุ่มและจัดการระบบ แชทเรียลไทม์กับผู้ใช้งาน',
    avatar: 'https://images.unsplash.com/photo-1573496359142-b8d87734a5a2?q=80&w=250&auto=format&fit=crop'
  }
];

export const INITIAL_EVENTS: EventItem[] = [];

export const INITIAL_JOBS: JobItem[] = [];

export const INITIAL_APPLICATIONS: JobApplication[] = [];
